Revit 2024 API
Tile.TextureScaleLock Property
 The property labeled "Scale Lock" from the "Tile" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string TextureScaleLock { get; }
Visual Basic
Public Shared ReadOnly Property TextureScaleLock As String
	Get
Visual C++
public:
static property String^ TextureScaleLock {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Tile Class
Autodesk.Revit.DB.Visual Namespace